interFoam/campagneNonUniformDiss/D050L474W090Z000Hup132Hdown086Q060_RefineCylinder/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "startBC/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    
    
    inlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    /* Christoph Graef
    inlet
    {
        type            fixedValue;
        inletValue      $internalField;
        value           $internalField;
    }
	*/
    /*
    outlet
    {
        type    zeroGradient;
    }
    */
	outletWater
    {
        type           inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
	
	outletAir
    {
         type           inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    /*
    outletAir
    {
		type            zeroGradient; //Ostend
    }
	*/
	top
    {
         type           inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
	
	"(bottom|frontAndBack)"
    {
        type            kqRWallFunction;
        value           uniform $kHighRe;
    }

    obstacle
    {
        type            kqRWallFunction;
        value           uniform $kLowRe;
    }
        
}


// ************************************************************************* //
